# 定义游戏窗口的大小
SIZE = 400
# 定义游戏网格的数量
GRID_LEN = 4
# 定义网格之间的间距
GRID_PADDING = 10

# 定义游戏背景颜色
BACKGROUND_COLOR_GAME = "#92877d"
# 定义空单元格的背景颜色
BACKGROUND_COLOR_CELL_EMPTY = "#9e948a"

# 定义不同数值单元格的背景颜色字典
BACKGROUND_COLOR_DICT = {
    # 数值为 2 的单元格背景颜色
    2:      "#eee4da",
    # 数值为 4 的单元格背景颜色
    4:      "#ede0c8",
    # 数值为 8 的单元格背景颜色
    8:      "#f2b179",
    # 数值为 16 的单元格背景颜色
    16:     "#f59563",
    # 数值为 32 的单元格背景颜色
    32:     "#f67c5f",
    # 数值为 64 的单元格背景颜色
    64:     "#f65e3b",
    # 数值为 128 的单元格背景颜色
    128:    "#edcf72",
    # 数值为 256 的单元格背景颜色
    256:    "#edcc61",
    # 数值为 512 的单元格背景颜色
    512:    "#edc850",
    # 数值为 1024 的单元格背景颜色
    1024:   "#edc53f",
    # 数值为 2048 的单元格背景颜色
    2048:   "#edc22e",
    # 数值为 4096 的单元格背景颜色
    4096:   "#eee4da",
    # 数值为 8192 的单元格背景颜色
    8192:   "#edc22e",
    # 数值为 16384 的单元格背景颜色
    16384:  "#f2b179",
    # 数值为 32768 的单元格背景颜色
    32768:  "#f59563",
    # 数值为 65536 的单元格背景颜色
    65536:  "#f67c5f",
}

# 定义不同数值单元格的文本颜色字典
CELL_COLOR_DICT = {
    # 数值为 2 的单元格文本颜色
    2:      "#776e65",
    # 数值为 4 的单元格文本颜色
    4:      "#776e65",
    # 数值为 8 的单元格文本颜色
    8:      "#f9f6f2",
    # 数值为 16 的单元格文本颜色
    16:     "#f9f6f2",
    # 数值为 32 的单元格文本颜色
    32:     "#f9f6f2",
    # 数值为 64 的单元格文本颜色
    64:     "#f9f6f2",
    # 数值为 128 的单元格文本颜色
    128:    "#f9f6f2",
    # 数值为 256 的单元格文本颜色
    256:    "#f9f6f2",
    # 数值为 512 的单元格文本颜色
    512:    "#f9f6f2",
    # 数值为 1024 的单元格文本颜色
    1024:   "#f9f6f2",
    # 数值为 2048 的单元格文本颜色
    2048:   "#f9f6f2",
    # 数值为 4096 的单元格文本颜色
    4096:   "#776e65",
    # 数值为 8192 的单元格文本颜色
    8192:   "#f9f6f2",
    # 数值为 16384 的单元格文本颜色
    16384:  "#776e65",
    # 数值为 32768 的单元格文本颜色
    32768:  "#776e65",
    # 数值为 65536 的单元格文本颜色
    65536:  "#f9f6f2",
}

# 定义游戏文本的字体样式
FONT = ("Verdana", 40, "bold")

# 定义退出游戏的按键
KEY_QUIT = "Escape"
# 定义返回的按键
KEY_BACK = "b"

# 定义控制游戏的方向键
KEY_UP = "Up"
KEY_DOWN = "Down"
KEY_LEFT = "Left"
KEY_RIGHT = "Right"

# 定义第一组替代控制游戏的按键
KEY_UP_ALT1 = "w"
KEY_DOWN_ALT1 = "s"
KEY_LEFT_ALT1 = "a"
KEY_RIGHT_ALT1 = "d"

# 定义第二组替代控制游戏的按键
KEY_UP_ALT2 = "i"
KEY_DOWN_ALT2 = "k"
KEY_LEFT_ALT2 = "j"
KEY_RIGHT_ALT2 = "l"
